#+Title: Using classes from datastate() with explicit template_data for rendering mustache in cfengine 3
#+AUTHOR: Nick Anderson
#+DATE: 2018-10-19
#+TAGS: cfengine3
#+DRAFT: false

This was [[https://groups.google.com/d/msg/help-cfengine/VktwAdsQ3zc/FplxWLezAwAJ][asked on the CFEngine Help Mailing list]] on October 1st 2018.

#+BEGIN_QUOTE
  How can I use classes in a mustache template while passing explicit data to =template_data=?  
#+END_QUOTE

When a mustache template is rendered without providing explicit data to the
 =template_data= attribute in a files promise =datastate()= is used.
 =datastate()= contains the JSON representation of the current cfengine state.

When providing explicit data the variables and classes from the current state
are not included. In order to use them, you must pick them out from the
datastate and merge them into your explicit data.

For example:

#+BEGIN_SRC cfengine3
  bundle agent main
  {
    classes:

      "My_Class";

     vars:

       "m" data => '{ "MyData": "explicit" }';

       # Get current datastate, pick classes, reparent classes, merge explicit
       # data on to classes

       "s" data => datastate(), if => not( isvariable ( s ) );
       "c" data => mergedata( '{ }', "s[classes]" );
       "c1" data => mergedata( '{"classes": c}' );
       "r" data => mergedata( c1, m );

     reports:
       "Without merging in classes from datastate:$(const.n)$(with)"
          with => string_mustache("My data is {{{MyData}}} and My_Class is {{#classes.My_Class}}defined{{/classes.My_Class}}{{^classes.My_Class}}not defined{{/classes.My_Class}}", m );

        "With merging in classes from datastate:$(const.n)$(with)"
          with => string_mustache("My data is {{{MyData}}} and My_Class is {{#classes.My_Class}}defined{{/classes.My_Class}}{{^classes.My_Class}}not defined{{/classes.My_Class}}", r );
  }
#+END_SRC

#+RESULTS:
: R: Without merging in classes from datastate:
: My data is explicit and My_Class is not defined
: R: With merging in classes from datastate:
: My data is explicit and My_Class is not defined

What does the full =datastate()= look like?

I saved this for the end since it's quite long, note top level =vars= and
 =classes= keys:
 
#+BEGIN_SRC JSON
 {
  "classes": {
    "127_0_0_1": true,
    "172_17_0_1": true,
    "192_168_122_1": true,
    "192_168_33_1": true,
    "192_168_42_189": true,
    "4_cpus": true,
    "64_bit": true,
    "Afternoon": true,
    "Day18": true,
    "GMT_Day18": true,
    "GMT_Evening": true,
    "GMT_Hr18": true,
    "GMT_Hr18_Q1": true,
    "GMT_Lcycle_2": true,
    "GMT_Min10_15": true,
    "GMT_Min13": true,
    "GMT_October": true,
    "GMT_Q1": true,
    "GMT_Thursday": true,
    "GMT_Yr2018": true,
    "Hr13": true,
    "Hr13_Q1": true,
    "Lcycle_2": true,
    "Min10_15": true,
    "Min13": true,
    "October": true,
    "PK_SHA_43c979e264924d0b4a2d3b568d71ab8c768ef63487670f2c51cd85e8cec63834": true,
    "Q1": true,
    "Thursday": true,
    "Yr2018": true,
    "agent": true,
    "any": true,
    "cfengine": true,
    "cfengine_3": true,
    "cfengine_3_12": true,
    "cfengine_3_12_0": true,
    "compiled_on_linux_gnu": true,
    "debian": true,
    "debian_buster": true,
    "enterprise": true,
    "enterprise_3": true,
    "enterprise_3_12": true,
    "enterprise_3_12_0": true,
    "My_Class": true,
    "fe80__5ee0_c5ff_fe9f_f38f": true,
    "fe80__800_27ff_fe00_3": true,
    "feature": true,
    "feature_curl": true,
    "feature_def": true,
    "feature_def_json": true,
    "feature_def_json_preparse": true,
    "feature_xml": true,
    "feature_yaml": true,
    "ipv4_127": true,
    "ipv4_127_0": true,
    "ipv4_127_0_0": true,
    "ipv4_127_0_0_1": true,
    "ipv4_172": true,
    "ipv4_172_17": true,
    "ipv4_172_17_0": true,
    "ipv4_172_17_0_1": true,
    "ipv4_192": true,
    "ipv4_192_168": true,
    "ipv4_192_168_122": true,
    "ipv4_192_168_122_1": true,
    "ipv4_192_168_33": true,
    "ipv4_192_168_33_1": true,
    "ipv4_192_168_42": true,
    "ipv4_192_168_42_189": true,
    "ipv4_gw_192_168_42_1": true,
    "ipv6_fe80__5ee0_c5ff_fe9f_f38f": true,
    "ipv6_fe80__800_27ff_fe00_3": true,
    "linux": true,
    "linux_4_15_0_33_lowlatency": true,
    "linux_x86_64": true,
    "linux_x86_64_4_15_0_33_lowlatency": true,
    "linux_x86_64_4_15_0_33_lowlatency__36_Ubuntu_SMP_PREEMPT_Wed_Aug_15_17_20_28_UTC_2018": true,
    "mac_02_42_f3_06_75_6d": true,
    "mac_0a_00_27_00_00_03": true,
    "mac_52_54_00_6b_62_06": true,
    "mac_5c_e0_c5_9f_f3_8f": true,
    "net_iface_docker0": true,
    "net_iface_lo": true,
    "net_iface_vboxnet3": true,
    "net_iface_virbr0": true,
    "net_iface_wlan0": true,
    "nickanderson_thinkpad_w550s": true,
    "nova": true,
    "nova_3": true,
    "nova_3_12": true,
    "nova_3_12_0": true,
    "nova_edition": true,
    "systemd": true,
    "ubuntu": true,
    "ubuntu_18": true,
    "ubuntu_18_04": true,
    "ubuntu_18_4": true,
    "x86_64": true
  },
  "vars": {
    "const": {
      "dirsep": "/",
      "dollar": "$",
      "endl": "\n",
      "n": "\n",
      "r": "\r",
      "t": "\t"
    },
    "def": {
      "jq": "jq --compact-output --monochrome-output --ascii-output --unbuffered --sort-keys"
    },
    "sys": {
      "arch": "x86_64",
      "bindir": "/home/nickanderson/.cfagent/bin",
      "cdate": "Thu_Oct_18_13_13_14_2018",
      "cf_agent": "\"/home/nickanderson/.cfagent/bin/cf-agent\"",
      "cf_execd": "\"/home/nickanderson/.cfagent/bin/cf-execd\"",
      "cf_key": "\"/home/nickanderson/.cfagent/bin/cf-key\"",
      "cf_monitord": "\"/home/nickanderson/.cfagent/bin/cf-monitord\"",
      "cf_net": "\"/home/nickanderson/.cfagent/bin/cf-net\"",
      "cf_promises": "\"/home/nickanderson/.cfagent/bin/cf-promises\"",
      "cf_runagent": "\"/home/nickanderson/.cfagent/bin/cf-runagent\"",
      "cf_serverd": "\"/home/nickanderson/.cfagent/bin/cf-serverd\"",
      "cf_twin": "\"/home/nickanderson/.cfagent/bin/cf-agent\"",
      "cf_upgrade": "\"/home/nickanderson/.cfagent/bin/cf-upgrade\"",
      "cf_version": "3.12.0",
      "cf_version_major": "3",
      "cf_version_minor": "12",
      "cf_version_patch": "0",
      "class": "linux",
      "cpus": "4",
      "crontab": "/var/spool/cron/crontabs/nickanderson",
      "date": "Thu Oct 18 13:13:14 2018",
      "doc_root": "/var/www",
      "domain": "",
      "enterprise_version": "3.12.0",
      "exports": "/etc/exports",
      "failsafe_policy_path": "/home/nickanderson/.cfagent/inputs/failsafe.cf",
      "flavor": "ubuntu_18",
      "flavour": "ubuntu_18",
      "fqhost": "nickanderson-thinkpad-w550s",
      "fstab": "/etc/fstab",
      "hardware_addresses": [
        "5c:e0:c5:9f:f3:8f",
        "52:54:00:6b:62:06",
        "02:42:f3:06:75:6d",
        "0a:00:27:00:00:03"
      ],
      "hardware_flags": [
        "up loopback running",
        "up broadcast running multicast",
        "up broadcast multicast",
        "up broadcast multicast",
        "up broadcast multicast"
      ],
      "hardware_mac[docker0]": "02:42:f3:06:75:6d",
      "hardware_mac[vboxnet3]": "0a:00:27:00:00:03",
      "hardware_mac[virbr0]": "52:54:00:6b:62:06",
      "hardware_mac[wlan0]": "5c:e0:c5:9f:f3:8f",
      "host": "nickanderson-thinkpad-w550s",
      "inet": {
        "default_gateway": "192.168.42.1",
        "default_route": {
          "active_default_gateway": true,
          "dest": "0.0.0.0",
          "flags": [
            "up",
            "net",
            "default",
            "gateway"
          ],
          "gateway": "192.168.42.1",
          "interface": "wlan0",
          "irtt": 0,
          "mask": "0.0.0.0",
          "metric": 600,
          "mtu": 0,
          "refcnt": 0,
          "use": 0,
          "window": 0
        },
        "routes": [
          {
            "active_default_gateway": true,
            "dest": "0.0.0.0",
            "flags": [
              "up",
              "net",
              "default",
              "gateway"
            ],
            "gateway": "192.168.42.1",
            "interface": "wlan0",
            "irtt": 0,
            "mask": "0.0.0.0",
            "metric": 600,
            "mtu": 0,
            "refcnt": 0,
            "use": 0,
            "window": 0
          },
          {
            "active_default_gateway": false,
            "dest": "169.254.0.0",
            "flags": [
              "up",
              "net",
              "not_default",
              "local"
            ],
            "gateway": "0.0.0.0",
            "interface": "virbr0",
            "irtt": 0,
            "mask": "255.255.0.0",
            "metric": 1000,
            "mtu": 0,
            "refcnt": 0,
            "use": 0,
            "window": 0
          },
          {
            "active_default_gateway": false,
            "dest": "172.17.0.0",
            "flags": [
              "up",
              "net",
              "not_default",
              "local"
            ],
            "gateway": "0.0.0.0",
            "interface": "docker0",
            "irtt": 0,
            "mask": "255.255.0.0",
            "metric": 0,
            "mtu": 0,
            "refcnt": 0,
            "use": 0,
            "window": 0
          },
          {
            "active_default_gateway": false,
            "dest": "192.168.33.0",
            "flags": [
              "up",
              "net",
              "not_default",
              "local"
            ],
            "gateway": "0.0.0.0",
            "interface": "vboxnet3",
            "irtt": 0,
            "mask": "255.255.255.0",
            "metric": 0,
            "mtu": 0,
            "refcnt": 0,
            "use": 0,
            "window": 0
          },
          {
            "active_default_gateway": false,
            "dest": "192.168.42.0",
            "flags": [
              "up",
              "net",
              "not_default",
              "local"
            ],
            "gateway": "0.0.0.0",
            "interface": "wlan0",
            "irtt": 0,
            "mask": "255.255.255.0",
            "metric": 600,
            "mtu": 0,
            "refcnt": 0,
            "use": 0,
            "window": 0
          },
          {
            "active_default_gateway": false,
            "dest": "192.168.122.0",
            "flags": [
              "up",
              "net",
              "not_default",
              "local"
            ],
            "gateway": "0.0.0.0",
            "interface": "virbr0",
            "irtt": 0,
            "mask": "255.255.255.0",
            "metric": 0,
            "mtu": 0,
            "refcnt": 0,
            "use": 0,
            "window": 0
          }
        ],
        "stats": {
          "IpExt": {
            "InBcastOctets": "3015067",
            "InBcastPkts": "25111",
            "InCEPkts": "0",
            "InCsumErrors": "0",
            "InECT0Pkts": "0",
            "InECT1Pkts": "0",
            "InMcastOctets": "296959",
            "InMcastPkts": "1595",
            "InNoECTPkts": "713030",
            "InNoRoutes": "1",
            "InOctets": "777023444",
            "InTruncatedPkts": "0",
            "OutBcastOctets": "1897663",
            "OutBcastPkts": "19854",
            "OutMcastOctets": "816221",
            "OutMcastPkts": "4787",
            "OutOctets": "210406788"
          },
          "TcpExt": {
            "ArpFilter": "0",
            "BusyPollRxPackets": "0",
            "DelayedACKLocked": "5",
            "DelayedACKLost": "295",
            "DelayedACKs": "4057",
            "EmbryonicRsts": "0",
            "IPReversePathFilter": "2",
            "ListenDrops": "0",
            "ListenOverflows": "0",
            "LockDroppedIcmps": "0",
            "OfoPruned": "0",
            "OutOfWindowIcmps": "0",
            "PAWSActive": "0",
            "PAWSEstab": "2",
            "PFMemallocDrop": "0",
            "PruneCalled": "107",
            "RcvPruned": "0",
            "SyncookiesFailed": "0",
            "SyncookiesRecv": "0",
            "SyncookiesSent": "0",
            "TCPACKSkippedChallenge": "2",
            "TCPACKSkippedFinWait2": "0",
            "TCPACKSkippedPAWS": "1",
            "TCPACKSkippedSeq": "2",
            "TCPACKSkippedSynRecv": "0",
            "TCPACKSkippedTimeWait": "0",
            "TCPAbortFailed": "0",
            "TCPAbortOnClose": "81",
            "TCPAbortOnData": "1466",
            "TCPAbortOnLinger": "0",
            "TCPAbortOnMemory": "0",
            "TCPAbortOnTimeout": "27",
            "TCPAutoCorking": "3619",
            "TCPBacklogDrop": "0",
            "TCPChallengeACK": "26",
            "TCPDSACKIgnoredNoUndo": "29",
            "TCPDSACKIgnoredOld": "0",
            "TCPDSACKOfoRecv": "0",
            "TCPDSACKOfoSent": "48",
            "TCPDSACKOldSent": "297",
            "TCPDSACKRecv": "70",
            "TCPDSACKUndo": "1",
            "TCPDeferAcceptDrop": "0",
            "TCPFastOpenActive": "0",
            "TCPFastOpenActiveFail": "0",
            "TCPFastOpenBlackhole": "0",
            "TCPFastOpenCookieReqd": "0",
            "TCPFastOpenListenOverflow": "0",
            "TCPFastOpenPassive": "0",
            "TCPFastOpenPassiveFail": "0",
            "TCPFastRetrans": "5",
            "TCPFromZeroWindowAdv": "22",
            "TCPFullUndo": "1",
            "TCPHPAcks": "21511",
            "TCPHPHits": "158023",
            "TCPHystartDelayCwnd": "429",
            "TCPHystartDelayDetect": "4",
            "TCPHystartTrainCwnd": "0",
            "TCPHystartTrainDetect": "0",
            "TCPKeepAlive": "5302",
            "TCPLossFailures": "0",
            "TCPLossProbeRecovery": "8",
            "TCPLossProbes": "138",
            "TCPLossUndo": "49",
            "TCPLostRetransmit": "0",
            "TCPMD5Failure": "0",
            "TCPMD5NotFound": "0",
            "TCPMD5Unexpected": "0",
            "TCPMTUPFail": "0",
            "TCPMTUPSuccess": "0",
            "TCPMemoryPressures": "0",
            "TCPMemoryPressuresChrono": "0",
            "TCPMinTTLDrop": "0",
            "TCPOFODrop": "0",
            "TCPOFOMerge": "47",
            "TCPOFOQueue": "21540",
            "TCPOrigDataSent": "79621",
            "TCPPartialUndo": "4",
            "TCPPureAcks": "32441",
            "TCPRcvCoalesce": "41200",
            "TCPRcvCollapsed": "0",
            "TCPRenoFailures": "0",
            "TCPRenoRecovery": "0",
            "TCPRenoRecoveryFail": "0",
            "TCPRenoReorder": "0",
            "TCPReqQFullDoCookies": "0",
            "TCPReqQFullDrop": "0",
            "TCPRetransFail": "0",
            "TCPSACKDiscard": "0",
            "TCPSACKReneging": "0",
            "TCPSACKReorder": "66",
            "TCPSYNChallenge": "28",
            "TCPSackFailures": "4",
            "TCPSackMerged": "3",
            "TCPSackRecovery": "6",
            "TCPSackRecoveryFail": "0",
            "TCPSackShiftFallback": "78",
            "TCPSackShifted": "8",
            "TCPSlowStartRetrans": "7",
            "TCPSpuriousRTOs": "1",
            "TCPSpuriousRtxHostQueues": "45",
            "TCPSynRetrans": "174",
            "TCPTSReorder": "4",
            "TCPTimeWaitOverflow": "0",
            "TCPTimeouts": "110",
            "TCPToZeroWindowAdv": "22",
            "TCPWantZeroWindowAdv": "166",
            "TCPWinProbe": "0",
            "TW": "2732",
            "TWKilled": "0",
            "TWRecycled": "0"
          }
        }
      },
      "inet6": {
        "addresses": {
          "lo": {
            "address": "0:0:0:0:0:0:0:1",
            "device_number": 1,
            "interface": "lo",
            "prefix_length": 128,
            "raw_flags": "80",
            "scope": 16
          },
          "vboxnet3": {
            "address": "fe80:0:0:0:800:27ff:fe00:3",
            "device_number": 11,
            "interface": "vboxnet3",
            "prefix_length": 64,
            "raw_flags": "80",
            "scope": 32
          },
          "wlan0": {
            "address": "fe80:0:0:0:5ee0:c5ff:fe9f:f38f",
            "device_number": 3,
            "interface": "wlan0",
            "prefix_length": 64,
            "raw_flags": "80",
            "scope": 32
          }
        },
        "routes": [
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "80",
            "flags": [
              "up",
              "net",
              "local"
            ],
            "interface": "lo",
            "metric": 256,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 1,
            "source_prefix": "00",
            "use": 0
          },
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "40",
            "flags": [
              "up",
              "net",
              "local"
            ],
            "interface": "wlan0",
            "metric": 256,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 1,
            "source_prefix": "00",
            "use": 0
          },
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "40",
            "flags": [
              "up",
              "net",
              "local"
            ],
            "interface": "vboxnet3",
            "metric": 256,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 1,
            "source_prefix": "00",
            "use": 0
          },
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "40",
            "flags": [
              "up",
              "net",
              "local"
            ],
            "interface": "wlan0",
            "metric": 600,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 1,
            "source_prefix": "00",
            "use": 0
          },
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "00",
            "flags": [
              "down",
              "net",
              "local"
            ],
            "interface": "lo",
            "metric": -1,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 1,
            "source_prefix": "00",
            "use": 1
          },
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "80",
            "flags": [
              "up",
              "net",
              "local"
            ],
            "interface": "vboxnet3",
            "metric": 0,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 2,
            "source_prefix": "00",
            "use": 0
          },
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "80",
            "flags": [
              "up",
              "net",
              "local"
            ],
            "interface": "wlan0",
            "metric": 0,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 2,
            "source_prefix": "00",
            "use": 0
          },
          {
            "dest": "0:0:0:0:0:0:0:0",
            "dest_prefix": "00",
            "flags": [
              "down",
              "net",
              "local"
            ],
            "interface": "lo",
            "metric": -1,
            "next_hop": "0:0:0:0:0:0:0:0",
            "refcnt": 1,
            "source_prefix": "00",
            "use": 1
          }
        ],
        "stats": {
          "Icmp6InCsumErrors": 0,
          "Icmp6InDestUnreachs": 1,
          "Icmp6InEchoReplies": 0,
          "Icmp6InEchos": 0,
          "Icmp6InErrors": 1,
          "Icmp6InGroupMembQueries": 0,
          "Icmp6InGroupMembReductions": 0,
          "Icmp6InGroupMembResponses": 0,
          "Icmp6InMLDv2Reports": 4,
          "Icmp6InMsgs": 5,
          "Icmp6InNeighborAdvertisements": 0,
          "Icmp6InNeighborSolicits": 0,
          "Icmp6InParmProblems": 0,
          "Icmp6InPktTooBigs": 0,
          "Icmp6InRedirects": 0,
          "Icmp6InRouterAdvertisements": 0,
          "Icmp6InRouterSolicits": 0,
          "Icmp6InTimeExcds": 0,
          "Icmp6InType1": 1,
          "Icmp6InType143": 4,
          "Icmp6OutDestUnreachs": 1,
          "Icmp6OutEchoReplies": 0,
          "Icmp6OutEchos": 0,
          "Icmp6OutErrors": 0,
          "Icmp6OutGroupMembQueries": 0,
          "Icmp6OutGroupMembReductions": 0,
          "Icmp6OutGroupMembResponses": 0,
          "Icmp6OutMLDv2Reports": 32,
          "Icmp6OutMsgs": 49,
          "Icmp6OutNeighborAdvertisements": 0,
          "Icmp6OutNeighborSolicits": 3,
          "Icmp6OutParmProblems": 0,
          "Icmp6OutPktTooBigs": 0,
          "Icmp6OutRedirects": 0,
          "Icmp6OutRouterAdvertisements": 0,
          "Icmp6OutRouterSolicits": 13,
          "Icmp6OutTimeExcds": 0,
          "Icmp6OutType1": 1,
          "Icmp6OutType133": 13,
          "Icmp6OutType135": 3,
          "Icmp6OutType143": 32,
          "Ip6FragCreates": 0,
          "Ip6FragFails": 0,
          "Ip6FragOKs": 0,
          "Ip6InAddrErrors": 0,
          "Ip6InBcastOctets": 0,
          "Ip6InCEPkts": 0,
          "Ip6InDelivers": 950,
          "Ip6InDiscards": 0,
          "Ip6InECT0Pkts": 0,
          "Ip6InECT1Pkts": 0,
          "Ip6InHdrErrors": 0,
          "Ip6InMcastOctets": 233983,
          "Ip6InMcastPkts": 794,
          "Ip6InNoECTPkts": 972,
          "Ip6InNoRoutes": 0,
          "Ip6InOctets": 282697,
          "Ip6InReceives": 972,
          "Ip6InTooBigErrors": 0,
          "Ip6InTruncatedPkts": 0,
          "Ip6InUnknownProtos": 0,
          "Ip6OutBcastOctets": 0,
          "Ip6OutDiscards": 6,
          "Ip6OutForwDatagrams": 0,
          "Ip6OutMcastOctets": 370237,
          "Ip6OutMcastPkts": 1028,
          "Ip6OutNoRoutes": 10503,
          "Ip6OutOctets": 418799,
          "Ip6OutRequests": 1204,
          "Ip6ReasmFails": 0,
          "Ip6ReasmOKs": 0,
          "Ip6ReasmReqds": 0,
          "Ip6ReasmTimeout": 0,
          "Udp6IgnoredMulti": 0,
          "Udp6InCsumErrors": 0,
          "Udp6InDatagrams": 822,
          "Udp6InErrors": 0,
          "Udp6NoPorts": 1,
          "Udp6OutDatagrams": 1026,
          "Udp6RcvbufErrors": 0,
          "Udp6SndbufErrors": 0,
          "UdpLite6InCsumErrors": 0,
          "UdpLite6InDatagrams": 0,
          "UdpLite6InErrors": 0,
          "UdpLite6NoPorts": 0,
          "UdpLite6OutDatagrams": 0,
          "UdpLite6RcvbufErrors": 0,
          "UdpLite6SndbufErrors": 0
        }
      },
      "inputdir": "/home/nickanderson/.cfagent/inputs",
      "interface": "vboxnet3",
      "interface_flags[docker0]": "up broadcast multicast",
      "interface_flags[lo]": "up loopback running",
      "interface_flags[vboxnet3]": "up broadcast multicast",
      "interface_flags[virbr0]": "up broadcast multicast",
      "interface_flags[wlan0]": "up broadcast running multicast",
      "interfaces": [
        "wlan0",
        "virbr0",
        "docker0",
        "vboxnet3"
      ],
      "interfaces_data": {
        "docker0": {
          "device": "docker0",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "eth0": {
          "device": "eth0",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "lo": {
          "device": "lo",
          "receive_bytes": "172553758",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "110740",
          "transmit_bytes": "172553758",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "110740"
        },
        "vboxnet0": {
          "device": "vboxnet0",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet1": {
          "device": "vboxnet1",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet10": {
          "device": "vboxnet10",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet2": {
          "device": "vboxnet2",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet3": {
          "device": "vboxnet3",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "143066",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "496"
        },
        "vboxnet4": {
          "device": "vboxnet4",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet5": {
          "device": "vboxnet5",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet6": {
          "device": "vboxnet6",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet7": {
          "device": "vboxnet7",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet8": {
          "device": "vboxnet8",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "vboxnet9": {
          "device": "vboxnet9",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "virbr0": {
          "device": "virbr0",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "virbr0-nic": {
          "device": "virbr0-nic",
          "receive_bytes": "0",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "0",
          "transmit_bytes": "0",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "0"
        },
        "wlan0": {
          "device": "wlan0",
          "receive_bytes": "623927214",
          "receive_compressed": "0",
          "receive_drop": "0",
          "receive_errors": "0",
          "receive_fifo": "0",
          "receive_frame": "0",
          "receive_multicast": "0",
          "receive_packets": "590187",
          "transmit_bytes": "47718190",
          "transmit_compressed": "0",
          "transmit_drop": "0",
          "transmit_errors": "0",
          "transmit_fifo": "0",
          "transmit_frame": "0",
          "transmit_multicast": "0",
          "transmit_packets": "257330"
        }
      },
      "ip2iface[127.0.0.1]": "lo",
      "ip2iface[172.17.0.1]": "docker0",
      "ip2iface[192.168.122.1]": "virbr0",
      "ip2iface[192.168.33.1]": "vboxnet3",
      "ip2iface[192.168.42.189]": "wlan0",
      "ip_addresses": [
        "127.0.0.1",
        "192.168.42.189",
        "192.168.122.1",
        "172.17.0.1",
        "192.168.33.1"
      ],
      "ipv4": "192.168.42.189",
      "ipv4[docker0]": "172.17.0.1",
      "ipv4[lo]": "127.0.0.1",
      "ipv4[vboxnet3]": "192.168.33.1",
      "ipv4[virbr0]": "192.168.122.1",
      "ipv4[wlan0]": "192.168.42.189",
      "ipv4_1[docker0]": "172",
      "ipv4_1[lo]": "127",
      "ipv4_1[vboxnet3]": "192",
      "ipv4_1[virbr0]": "192",
      "ipv4_1[wlan0]": "192",
      "ipv4_2[docker0]": "172.17",
      "ipv4_2[lo]": "127.0",
      "ipv4_2[vboxnet3]": "192.168",
      "ipv4_2[virbr0]": "192.168",
      "ipv4_2[wlan0]": "192.168",
      "ipv4_3[docker0]": "172.17.0",
      "ipv4_3[lo]": "127.0.0",
      "ipv4_3[vboxnet3]": "192.168.33",
      "ipv4_3[virbr0]": "192.168.122",
      "ipv4_3[wlan0]": "192.168.42",
      "key_digest": "SHA=43c979e264924d0b4a2d3b568d71ab8c768ef63487670f2c51cd85e8cec63834",
      "libdir": "/home/nickanderson/.cfagent/inputs/lib",
      "local_libdir": "lib",
      "logdir": "/home/nickanderson/.cfagent/log",
      "long_arch": "linux_x86_64_4_15_0_33_lowlatency__36_Ubuntu_SMP_PREEMPT_Wed_Aug_15_17_20_28_UTC_2018",
      "maildir": "/var/spool/mail",
      "masterdir": "/home/nickanderson/.cfagent/masterfiles",
      "nova_version": "3.12.0",
      "os": "linux",
      "os_release": {
        "BUG_REPORT_URL": "https://bugs.launchpad.net/ubuntu/",
        "HOME_URL": "https://www.ubuntu.com/",
        "ID": "ubuntu",
        "ID_LIKE": "debian",
        "NAME": "Ubuntu",
        "PRETTY_NAME": "Ubuntu 18.04.1 LTS",
        "PRIVACY_POLICY_URL": "https://www.ubuntu.com/legal/terms-and-policies/privacy-policy",
        "SUPPORT_URL": "https://help.ubuntu.com/",
        "UBUNTU_CODENAME": "bionic",
        "VERSION": "18.04.1 LTS (Bionic Beaver)",
        "VERSION_CODENAME": "bionic",
        "VERSION_ID": "18.04"
      },
      "ostype": "linux_x86_64",
      "piddir": "/home/nickanderson/.cfagent",
      "policy_entry_basename": "cfengine3-7276j3m",
      "policy_entry_dirname": "/home/nickanderson/src/nickanderson.github.io/content/post",
      "policy_entry_filename": "/home/nickanderson/src/nickanderson.github.io/content/post/cfengine3-7276j3m",
      "release": "4.15.0-33-lowlatency",
      "resolv": "/etc/resolv.conf",
      "statedir": "/home/nickanderson/.cfagent/state",
      "sysday": "17822",
      "systime": "1539886394",
      "update_policy_path": "/home/nickanderson/.cfagent/inputs/update.cf",
      "uptime": "221",
      "uqhost": "nickanderson-thinkpad-w550s",
      "user_data": {
        "description": "Nick Anderson",
        "gid": 1000,
        "home_dir": "/home/nickanderson",
        "shell": "/usr/bin/zsh",
        "uid": 1000,
        "username": "nickanderson"
      },
      "version": "#36-Ubuntu SMP PREEMPT Wed Aug 15 17:20:28 UTC 2018",
      "workdir": "/home/nickanderson/.cfagent"
    }
  }
}
#+END_SRC

